package feb21;

public class ReviewArray09 {

	public static void main(String[] args) {
		//Test09
		//우리가 배운 내용들은 다음과 같습니다.

		//변수
		//입출력
		//조건
		//반복
		//배열
		//위의 항목들을 배열에 저장하고 다음 문제를 푸세요

		//항목들 중에서 무작위로 하나를 출력하도록 구현하세요(Random 사용)
		//제시된 데이터는 배운 순서대로 되어 있습니다. 
		//가장 최근에 배운 내용부터 출력하려면 배열의 데이터를 반대로 뒤집어야 합니다. 
		//(배열 - 반복 - 조건 - 입출력 - 변수) 
		//출력만 반대로 하는 것이 아니라 배열 자체를 뒤집어서 출력하도록 구현해보세요
		
		//배열을 시계방향으로 1회전 하고 출력하세요 
		//(ex) 1회전하면 배열 - 변수 - 입출력 - 조건 - 반복 순으로 데이터의 위치가 변합니다.

	}

}
